[section_name]
title: Detect unauthorized password change attempts adm_builtin account
id: 12345
description: Detects change the password of the adm_builtin account
status: experimental
references:
    - https://attack.mitre.org/techniques/T1003/
    - https://attack.mitre.org/techniques/T1087/
    - https://attack.mitre.org/techniques/T1098/
    - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4767
    - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4776
author: Oscar
date: 2021/06/01
modified: 2022/10/09
tags:
    - attack.t1003
    - attack.t1087
    - attack.t1098
logsource:
    product: windows
detection:
    selection:
        EventID:
            - '4767'
            - '4776'
        TargetUserName: 'adm_builtin'
        NewUACValue: '0x20'
    condition: selection
fields:
    - AccountName
    - AccountDomain
    - TargetUserName
    - TargetDomainName
    - WorkstationName
    - IPAddress
    - SubjectUserName
    - SubjectDomainName
    - SubjectLogonId
    - NewUACValue
    - AdditionalInformation
falsepositives:
    - Authorized password changes
    - Local password changes
level: high
